[
  {
    "id": "walking-by-faith-not-sight-2024",
    "title": "Walking by Faith, Not by Sight",
    "speaker": "Pastor Michael Johnson",
    "date": "2025-07-19T11:56:15.390Z",
    "description": "<p>In times of uncertainty and challenge, God calls us to trust Him completely, even when we can't see the full picture. This powerful message explores 2 Corinthians 5:7 and how we can develop unwavering faith that sustains us through life's storms.</p><p>Discover practical steps to strengthen your faith, overcome doubt, and experience God's peace that surpasses understanding. Learn how biblical heroes like Abraham, Moses, and David walked by faith and how their examples can guide us today.</p><p>Key points: Understanding God's faithfulness, overcoming fear with trust, and finding hope in God's promises.</p>",
    "videoUrl": "https://vimeo.com/apostolic-church/walking-by-faith",
    "audioUrl": "https://soundcloud.com/apostolic-church/walking-by-faith-audio",
    "thumbnailUrl": "/images/walking-by-faith-sermon.jpg",
    "status": "published",
    "createdAt": "2025-07-19T11:56:15.390Z"
  },
  {
    "id": "love-in-action-serving-others-2024",
    "title": "Love in Action: Serving Others",
    "speaker": "Pastor Sarah Williams",
    "date": "2025-07-12T11:56:15.390Z",
    "description": "<p>True love is demonstrated through action, not just words. This inspiring message challenges us to move beyond comfortable Christianity and actively serve those around us, following Christ's example of sacrificial love.</p><p>Explore Jesus' teachings on service, the parable of the Good Samaritan, and practical ways to show God's love in our daily lives. Discover how serving others transforms not only their lives but our own hearts as well.</p><p>Learn about opportunities to serve in our church and community, and find your unique calling to make a difference in the world around you.</p>",
    "videoUrl": "https://vimeo.com/apostolic-church/love-in-action",
    "audioUrl": "https://soundcloud.com/apostolic-church/love-in-action-audio",
    "thumbnailUrl": "/images/love-in-action-sermon.jpg",
    "status": "published",
    "createdAt": "2025-07-12T11:56:15.390Z"
  },
  {
    "id": "finding-peace-in-gods-presence-2024",
    "title": "Finding Peace in God's Presence",
    "speaker": "Pastor Michael Johnson",
    "date": "2025-07-05T11:56:15.390Z",
    "description": "<p>In our fast-paced, anxiety-filled world, God offers us a peace that the world cannot give. This comforting message explores Philippians 4:6-7 and teaches us how to find rest and tranquility in God's loving presence.</p><p>Learn the difference between worldly peace and God's peace, discover the power of prayer and meditation, and understand how worship and gratitude can transform our perspective on life's challenges.</p><p>Practical applications include developing a daily quiet time, practicing biblical meditation, and creating space for God in our busy schedules.</p>",
    "videoUrl": "https://vimeo.com/apostolic-church/finding-peace",
    "audioUrl": "https://soundcloud.com/apostolic-church/finding-peace-audio",
    "thumbnailUrl": "/images/finding-peace-sermon.jpg",
    "status": "published",
    "createdAt": "2025-07-05T11:56:15.390Z"
  },
  {
    "id": "the-power-of-forgiveness-2024",
    "title": "The Power of Forgiveness",
    "speaker": "Pastor Sarah Williams",
    "date": "2025-06-28T11:56:15.390Z",
    "description": "<p>Forgiveness is one of the most challenging yet liberating acts we can perform. This transformative message explores Jesus' teachings on forgiveness and how releasing others from their wrongs against us actually sets us free.</p><p>Discover the difference between forgiveness and reconciliation, learn practical steps to forgive even when it's difficult, and understand how God's forgiveness of us empowers us to forgive others.</p><p>This message includes real-life testimonies of forgiveness and healing, showing how God can restore relationships and bring beauty from ashes.</p>",
    "videoUrl": "https://vimeo.com/apostolic-church/power-of-forgiveness",
    "audioUrl": "https://soundcloud.com/apostolic-church/power-of-forgiveness-audio",
    "thumbnailUrl": "/images/forgiveness-sermon.jpg",
    "status": "published",
    "createdAt": "2025-06-28T11:56:15.391Z"
  }
]